Repository: doc-l10n-kit/ja-infinispan
Catalog: l10n/tmx/infinispan.tmx
Source language: en
Languages: ja_jp

source: Create an application initializer class that will auto-register the requisite servlet filters required by Spring Session:
ja_jp: Spring Sessionが必要とするサーブレットフィルターを自動登録するアプリケーションイニシャライザークラスを作成します。

source: Create a `@WebListener` that bootstraps our session repository configuration:
ja_jp: セッションリポジトリの構成を自動構築する `@WebListener` を作成します。

source: Deploying your application will automatically create a new cache instance in the Infinispan cluster named according to the the host and context of the web application.
ja_jp: アプリケーションをデプロイすると、Webアプリケーションのホストとコンテキストに応じた名前の新しいキャッシュ・インスタンスがInfinispanクラスタに自動的に作成されます。

source: Can I use WildFly clustering Spring Session outside of WildFly?
ja_jp: Wildfly clustering spring sessionはWildFly以外でも使用できますか？

source: Of course! Like most Spring Session repository implementations, it is meant to work with any implementation of the Jakarta Servlet 4.0 specification. The project https://github.com/wildfly-clustering/wildfly-clustering-spring-session[README] contains sample instructions for installing on Tomcat.
ja_jp: もちろんです！ほとんどのSpring Sessionリポジトリの実装と同様に、Jakarta Servlet 4.0仕様のあらゆる実装で動作するようになっています。プロジェクトの link:https://github.com/wildfly-clustering/wildfly-clustering-spring-session[README]には、Tomcatにインストールするためのサンプル手順が記載されています。

source: Where can I find it?
ja_jp: どこで手に入るの？

source: You can find the source code on https://github.com/wildfly-clustering/wildfly-clustering-spring-session[github]. Contributions are always welcome!
ja_jp: ソースコードは link:https://github.com/wildfly-clustering/wildfly-clustering-spring-session[github]で公開されています。貢献をいつでもお待ちしております。

source: File any issues with the https://github.com/wildfly-clustering/wildfly-clustering-spring-session/issues[github issue tracker].
ja_jp: 問題があれば link:https://github.com/wildfly-clustering/wildfly-clustering-spring-session/issues[github課題トラッカー]に提出してください。

source: Checkout the https://github.com/wildfly-clustering/wildfly-clustering-spring-session/blob/master/README.md[README] for more details.
ja_jp: 詳しくは link:https://github.com/wildfly-clustering/wildfly-clustering-spring-session/blob/master/README.md[README]をご覧ください。

source: Enjoy!
ja_jp: お楽しみに！

source: The Developer Conference Sao Paulo
ja_jp: 開発者会議 サンパウロ

source: What is The Developer’s Conference?
ja_jp: 開発者会議とは？

source: The Developer’s Conference (TDC) is the largest event related to software development in Brazil connecting meetup and event organizers, speakers, companies and sponsors on a single platform, empowering the local ecosystem of each region it's realized.
ja_jp: 開発者会議（TDC）は、それを実現している各地域の業界全体の収益構造に力を与え、単一のプラットフォーム上でミートアップやイベント主催者、スピーカー、企業やスポンサーを接続するブラジルのソフトウェア開発に関連する最大のイベントです。

source: TDC is a very dynamic conference aimed to present the most important topics according to local and international needs and, for this reason, there are more than ten parallel tracks a day.
ja_jp: TDCは、地域や国際的なニーズに応じて最も重要なトピックを発表することを目的とした非常にダイナミックな会議であり、そのため、1日に10以上のトラックが並行して行われます。

source: This event takes place once a year in some cities in Brazil, but this year the event will be totally online due to COVID-19 impact.
ja_jp: このイベントはブラジルの一部の都市で年に一度行われますが、今年はCOVID-19の影響で完全にオンラインでの開催となります。

source: Red Hat will be present on this event with 6 principal lectures and one room occurring simultaneously throughout the event. We will have an Infinispan presentation showing some important features, what's new, demos and Quarkus integration at Red Hat sponsor room.
ja_jp: このイベントにはRed Hatが参加し、6つの主要な講演と1つの部屋がイベント全体で同時開催されます。Red Hatのスポンサールームでは、重要な機能、最新情報、デモ、Quarkusの統合などを紹介するInfinispanのプレゼンテーションを行います。

source: When the Infinispan presentation will happen?
ja_jp: Infinispanの発表はいつ？

source: Hour
ja_jp: 時間

source: Timezone
ja_jp: タイムゾーン

source: BRT (GMT-3)
ja_jp: ブラジル時間（グリニッジ標準時-3）

source: EDT (UTC-4)
ja_jp: 米国東部標準時(夏時間)（協定世界時-4）

source: BST (UTC+1)
ja_jp: 英国(夏時間)（協定世界時+1）

source: CEST (UTC+2)
ja_jp: 中央ヨーロッパ時間(夏時間)（協定世界時+2）

source: Persistence
ja_jp: 永続性

source: Sub-task
ja_jp: サブタスク

source: Feature Request
ja_jp: 機能リクエスト

source: Bug
ja_jp: バグ

source: Task
ja_jp: タスク

source: Component Upgrade
ja_jp: コンポーネントのアップグレード

source: Enhancement
ja_jp: 改善

source: Off Heap enhancements
ja_jp: オフヒープの強化

source: The off heap implementation in Infinispan has become much more widely used since its introduction. There have been some issues and improvements identified to get this storage type more in line with its heap counterpart. For those of you that are unware the off-heap setting is actually only "off" the JVM heap and still resides in the native memory of the application.
ja_jp: Infinispan のオフヒープ実装は、その導入以来、より広く使用されるようになりました。このストレージタイプをヒープ対応のストレージタイプに近づけるために、いくつかの問題点と改善点が確認されています。ご存知ない方のために、オフヒープ設定は実際にはJVMヒープを「オフ」にしているだけで、アプリケーションのネイティブメモリに存在しています。

source: The best part of all the below changes is the user does not need to change anything, other than configuring Off Heap storage.
ja_jp: 以下の変更点の中で最も優れている点は、オフヒープストレージを設定する以外にユーザーが何も変更する必要がないことです。

source: Resizing Off Heap Container
ja_jp: オフヒープコンテナのサイズ変更

source: For those of you that have used/configured off heap storage before you may have noticed that there was a configuration option named address count. This setting allowed you to configure how many address pointers the container had. You can think of this as essentially how many buckets you have in a HashMap. Unfortunately the number of pointers was fixed and therefore the user would have to know how many elements they expected to have.
ja_jp: 以前にオフヒープストレージを使用/設定したことがある人は、アドレスカウントという設定オプションがあることに気づいたかもしれません。この設定では、コンテナが持つアドレスポインタの数を設定することができます。これは、基本的には HashMap にあるバケットの数と考えることができます。残念ながら、ポインターの数は固定されていたので、ユーザーはどれだけの要素を持つと予想されるかを知る必要がありました。

source: This setting also had another problem. If the user required a larger size of elements this would increase startup time as the container can be iterated upon multiple times when it is empty. Iterating over a container of one million empty pointers would be much slower than iterating over one of only 1024 for example.
ja_jp: この設定にも問題がありました。ユーザーがより大きなサイズの要素を必要とする場合、コンテナが空になったときに何度も反復処理を行うことができるため、起動時間が長くなってしまいます。例えば、100万個の空のポインタを持つコンテナを反復処理するのは、1024個のコンテナを反復処理するよりもはるかに遅くなります。

source: I am glad to say as of Infinispan 10.0.0.Final this setting and the performance of iteration have been greatly improved.
ja_jp: 嬉しいことに、Infinispan 10.0.0.Finalでは、この設定とイテレーションのパフォーマンスが大幅に改善されました。

source: Configuration
ja_jp: 構成

source: The address count variable is now ignored and instead the off heap based container will start at smaller amount of "buckets" in the range of 128 or 256. We then apply a load factor of .75, which means we will automatically increase the size of the underlying "buckets" once we have inserted a number of entries being 75% or larger than the current "bucket" size.
ja_jp: アドレスカウント変数は無視され、代わりにオフヒープベースのコンテナは128または256の範囲の小さい量の「バケット」から始まります。そして、負荷率を0.75に設定します。これは、現在の「バケット」サイズよりも75%以上大きいエントリを挿入すると、自動的に基礎となる「バケット」のサイズを増加させることを意味します。

source: The resize operation will grow to have double the amount of "buckets" it had prior. The resize operation will be performed concurrently with other operations, providing minimal blocking as we have locks equal to the number of CPUs times two.
ja_jp: リサイズ操作は、以前の倍の量の「バケット」を持つようになります。リサイズ操作は他の操作と並行して実行され、CPU数の2倍に相当するロックがあるため、最小限のブロッキングを提供します。

source: This will allow for a cache with off heap to be started significantly faster and relieves some configuration options that were unneeded. Note that the map, just like a java.util.HashMap, will not decrease the number of "buckets" once it grows to a given size.
ja_jp: これにより、オフヒープのキャッシュを大幅に高速に起動することが可能になり、不要だったいくつかの設定オプションが解放されます。このMapは、java.util.HashMapのように、マップが一旦所定のサイズに成長すると「バケット」の数は減らないことに注意してください。

source: Iteration changes
ja_jp: イテレーションの変更

source: I mentioned that iteration was slower during startup of larger number of "buckets". This was due to it possibly having a large number of them, however it was also plauged by an ineffecient way of iterating over them. In addition to rewriting the resize operation, we have also optimized the memory layout so that "buckets" can be iterated sequentially which provides more mechanical sympathy.
ja_jp: 私は、より大きな数の「バケット」の起動時に反復処理が遅くなることを述べました。これは、バケットの数が多いことが原因である可能性がありますが、バケットの反復処理の不便さにも悩まされていました。リサイズ操作を書き換えることに加えて、「バケット」を順次反復処理できるようにメモリレイアウトを最適化し、より機械的な共感を得られるようにしました。

source: Hash changes
ja_jp: ハッシュの変更

source: This one is rather short and sweet, but the old hash algorithm we used would cause too many collisions for objects that had hash functions that returned values in a similar range, such as java.lang.Integer and java.util.String (with shared startubg characters).
ja_jp: これはかなり要領を得たものですが、私たちが使っていた古いハッシュアルゴリズムでは、似たような範囲の値を返すハッシュ関数を持つオブジェクトの衝突が多すぎました。これは、java.lang.Integerやjava.util.String（共有された開始文字を持つ）のような、類似した範囲の値を返します。

source: Therefore it has been changed to provide a bit better spreading. This is part of ISPN 10.0.0.Final.
ja_jp: そのため、少しだけ広がりが良くなるように変更されています。これは ISPN 10.0.0.Final の一部です。

source: Expiration bugs
ja_jp: 期限切れのバグ

source: Unfortunately off heap had a few issues with expiration. It didn't support max idle and expiration metadata was not properly transferred to new nodes during state transfer.
ja_jp: 残念ながらオフヒープは 期限切れの機能にいくつかの問題を抱えていました。それは最大アイドルをサポートしておらず、状態転送中に新しいノードへの期限切れメタデータの転送が適切に行われませんでした。

source: In addition to max idle algorithm being rewritten, Off heap now properly supports max idle as of 10.1.4.Final and 11.0.0.Final.
ja_jp: max idleアルゴリズムの書き換えに加え、10.1.4.Finalおよび11.0.0.Finalでは、オフヒープが正しくmax idleをサポートするようになりました。

source: Off heap metadata transferred to new nodes has been fixed in 10.1.8.Final and 11.0.0.Final.
ja_jp: 新しいノードに転送されるオフヒープメタデータが 10.1.8.Final および 11.0.0.Final で修正されました。

source: Cross Site Replication Improvements
ja_jp: 拠点横断レプリケーションの改善

source: Infinispan introduced Cross Site Replication functionality in version 5.2 and Infinispan 7 extended it to support state transfer. With an increase of popularity, Infinispan 11 brings two major improvements to Cross Site Replication. Let's take a look at them.
ja_jp: Infinispanはバージョン 5.2 で拠点横断レプリケーション機能を導入し、Infinispan 7 では状態転送をサポートするように拡張しました。人気の高まりに伴い、Infinispan 11では、拠点横断レプリケーションに2つの大きな改善点がもたらされました。それらを見てみましょう。

source: Support for multiple site masters
ja_jp: 複数の拠点マスターをサポート

source: Infinispan uses JGroups' http://www.jgroups.org/manual4/index.html#Relay2Advanced[RELAY2] protocol to enable inter-site communication. Each site has Site Masters: these are nodes with special roles, and are responsible for the communication between sites.
ja_jp: InfinispanはJGroupsの link:http://www.jgroups.org/manual4/index.html#Relay2Advanced[RELAY2] プロトコルを使用して、拠点間通信を可能にします。各拠点には拠点マスターがいます。これらは特別な役割を持つノードで、拠点間の通信を担当します。

source: RELAY2 can use more than one Site Master per site allowing load balancing of the inter-site requests. The new algorithm is now able to take advantage of multiple Site Masters.
ja_jp: RELAY2は、拠点間リクエストのロードバランシングを可能にするために、拠点ごとに複数の拠点マスターを使用できます。新しいアルゴリズムでは、複数の拠点マスターを利用できるようになりました。

source: The attribute `max_site_masters` configures the number of Site Masters, and it defaults to 1. To take advantage of the new algorithm, increase the number of Site Masters in RELAY2 configuration by changing `max_site_masters` to a value higher than 1. A number greater than the number of nodes can be used, and it enables the Site Master role in all nodes.
ja_jp: 属性 `max_site_masters` は拠点マスターの数を設定し、デフォルトは 1 です。 新しいアルゴリズムを利用するには、 `max_site_masters` を 1 よりも高い値に変更することで、RELAY2 構成の拠点マスターの数を増やしてください。 ノードの数よりも大きい数を使用することができ、すべてのノードで拠点マスターの役割を有効にします。

source: More information about RELAY2 is available in http://www.jgroups.org/manual4/index.html#RELAY2[JGroups' Manual].
ja_jp: RELAY2についての詳細は、 link:http://www.jgroups.org/manual4/index.html#RELAY2[JGroupsのマニュアル] に掲載されています。

source: Infinispan is able to detect conflicts in asynchronous mode by taking advantage of vector clocks. A conflict happens when 2 or more sites update the same key at the same time. Let's look at an example between 2 sites (_LON_ and _NYC_):
ja_jp: Infinispanは、ベクトルクロックを利用して非同期モードで衝突を検出できます。衝突は、2つ以上の拠点が同時に同じキーを更新した場合に発生します。2つの拠点（_LON_ と _NYC_ ）間の例を見てみましょう。

source: _LON_ puts `k1=2`, with vector clock `1,0`, and replicates it to _NYC_.
ja_jp: _LON_ は 、 `k1=2` , ベクトルクロック `1,0` , を入れて、 _NYC_ に複製します。

source: _NYC_ puts `k1=3`, with vector clock `1,1`, and replicates it to _LON_.
ja_jp: _NYC_ は 、 `k1=3` , ベクトルクロック `1,1` , を入れて、それを _LON_ に複製します。

source: However if _LON_ puts `k1=5` (with vector `2,1`), and _NYC_ puts `k1=8` in _NYC_ (with vector clock `1,2`) at the same time, Infinispan detects the conflict since none of the vector clocks are greater than the other.
ja_jp: しかし、 _LON_ が `k1=5` (ベクトル `2,1` ) を、 _NYC_ が `k1=8` を _NYC_ (ベクトルクロック `1,2` ) に同時に置くと、いずれのベクトルクロックも他よりも大きいため、Infinispan は競合を検出します。

source: Infinispan resolves the conflicts by comparing using the site names in lexicographical order. The site's name lower in lexicographical order takes priority. In the example above, both _LON_ and _NYC_ end up with `k1=5` since _LON_ < _NYC_.
ja_jp: Infinispan は、辞書順に拠点名を使用して比較することで競合を解決します。辞書順で下位のサイト名が優先されます。上の例では、 _LON_ < _NYC_ のため、 _LON_ と _NYC_ の両方が `k1=5` で終わります _。_

source: You can choose the priority by prepending a number to the site name. For example, if you want updates from _NYC_ to take priority over _LON_ updates, you can prepend a number to the site name, example: _1NYC_, _2LON_ and so on.
ja_jp: 拠点名の前に数字を付けることで優先順位を選択できます。例えば、 _NYC_ からの更新を _LON_の 更新よりも優先したい場合は、サイト名に数字を前置します。例: _1NYC_ と _2LON_

source: For more information check the https://infinispan.org/docs/dev/titles/xsite/xsite.html#conflicting_entries-xsite[Infinispan Documentation].
ja_jp: 詳細は link:https://infinispan.org/docs/dev/titles/xsite/xsite.html#conflicting_entries-xsite[Infinispanのドキュメント] をご覧ください。

source: Non Blocking Journey
ja_jp: ノンブロッキングの旅

source: As many you are probably aware recent trends have shown that making applications non blocking provides quite a few benefits allowing for greater scalability with less resources. Infinispan has been written and rewriting parts to take advantage of this as we can for both embedded and server use cases.
ja_jp: ご存知の方も多いと思いますが、最近の傾向として、アプリケーションをノンブロッキングにすることで、より少ないリソースでより大きな拡張性が得られることがわかってきました。Infinispan は、組み込みとサーバーの両方の使用例でこの利点を活用できるように書き換えられています。

source: The Infinispan Server has always utilized netty, however we may not have been the best about ensuring we didn't block the event loop. The HotRod Client in 9.2.0 also utilizes netty to provide for non blocking operations. The internal embedded interceptors were rewritten in 9.0.0 to provide for non blocking support for internal cache operations, which include put/get. Cache store operations in 10.0.0 were offloaded to a blocking thread pool to provide non blocking support.
ja_jp: Infinispanサーバは常にnettyを利用してきましたが、イベントループをブロックしないようにすることについてはベストではなかったかもしれません。9.2.0のHotRodクライアントもnettyを利用してノンブロッキング操作を提供しています。内部に埋め込まれたインターセプターは9.0.0で書き換えられ、put/getを含む内部キャッシュ操作のノンブロッキングサポートを提供しています。10.0.0 のキャッシュストア操作は、ノンブロッキングサポートを提供するために、ブロッキングスレッドプールに受けわたされました。

source: With the newest release we have rewritten lots of the internals of Infinispan to take advantage of non blocking as much as possible. The amount of changes is quite large and a bit hard to describe them all in this blog post. The various JIRA can be seen from https://issues.redhat.com/browse/ISPN-10309, which isn't even complete yet despite how many different changes we have done.
ja_jp: 最新のリリースでは、可能な限りノンブロッキングを活用するために、Infinispan の内部を多く書き換えました。変更点の量は非常に多く、このブログ記事ですべてを説明するのは少し難しいです。様々な JIRA は https://issues.redhat.com/browse/ISPN-10309 から見ることができますが、これはどれだけ多くの変更を行ったにもかかわらず、まだ完成していません。

source: The persistence SPI was completely rewritten in 11 with non blocking in mind as well and this will be covered in a future post as it has much more detailing it. For now you can rest assure that all prior stores will still work, however they may have or can be optimized to take into account non blocking support.
ja_jp: 永続性SPIは11でノンブロッキングを考慮して完全に書き直されました。これについては、より詳細な情報があるため、今後の記事で取り上げます。今のところ、以前のストアはすべて動作しますが、非ブロックサポートを考慮して最適化されている可能性がありますので、ご安心ください。

source: Conversions
ja_jp: 改装

source: Pretty much every module in the Infinispan code base has been changed to support non blocking. If code relies upon an API that is blocking that is known to be blocking, we offload those calls to a blocking thread pool to ensure we never block the non blocking thread.
ja_jp: Infinispan のコードベースのほとんどすべてのモジュールが、ノンブロッキングをサポートするように変更されました。コードがブロッキングされていることがわかっている API に依存している場合、ブロッキングされていないスレッドを決してブロッキングしないようにするために、ブロッキングスレッドプールにそれらの呼び出しを受け渡します。

source: Unfortunately some modules have not yet been updated and those are ones related to query. Query is in the middle of a giant refactoring and doing so would have caused massive conflicts and thus has been delayed to Infinispan 12. The server works around this by ensuring write operations performed upon a cache with query are always done in a blocking thread to ensure safety.
ja_jp: 残念ながら、まだアップデートされていないモジュールがあり、それは問い合わせに関するものです。問い合わせは大規模なリファクタリングの真っ最中であり、それを行うと大規模なコンフリクトが発生するため、Infinispan 12 に延期されました。サーバーはこの問題を回避するために、問い合わせ付きのキャッシュに対して行われる書き込み操作は、安全性を確保するために常にブロッキングスレッドで行われるようにしています。

source: Thread Pools
ja_jp: スレッドプール

source: Infinispan utilizes various thread pools for handling of operations. This table details how many thread pools each version of Infinispan can have.
ja_jp: Infinispan は、操作を処理するためにさまざまなスレッドプールを利用します。この表は、Infinispan の各バージョンが持てるスレッドプールの数を詳細に示しています。

source: Version
ja_jp: バージョン

source: Embedded
ja_jp: 組み込み

source: As you can see there is more than a 50 percent reduction of the number of thread pools in both embedded and server modes. This in turn has allowed for a reduction of the default number of threads as well as seen in the next table. Note that N is how many cores that are available to the JVM.
ja_jp: ご覧のように、組み込みモードとサーバモードの両方でスレッドプールの数が50%以上削減されています。これにより、次の表に示すように、デフォルトのスレッド数を削減することができました。Nは、JVMで利用可能なコア数であることに注意してください。

source: Maximum Default Thread Count
ja_jp: 最大デフォルトのスレッド数

source: After this consolidation we have non blocking and blocking thread pools. As you can see this allows us to reduce the maximum number of threads in embedded by about half and the server to a third of what it used to be before.
ja_jp: この統合の後、私たちはノンブロッキングとブロッキングのスレッドプールを持つようになりました。ご覧のように、これにより、組み込みの最大スレッド数を約半分に減らすことができ、サーバは以前の3分の1になりました。

source: The server has an additional thread pool for the netty event loop and unfortunately we cannot consolidate this thread pool, but it is planned for Infinispan 12, which will get us to the same number of threads and thread pools for both embedded and server modes.
ja_jp: サーバーにはnettyイベントループ用の追加スレッドプールがあり、残念ながらこのスレッドプールを統合することはできませんが、Infinispan 12で計画されており、組み込みモードとサーバーモードの両方で同じ数のスレッドとスレッドプールを利用できるようになります。

source: Note that this doesn't talk about the JGroups thread pool as this is unchanged and is the same.
ja_jp: JGroups スレッドプールは変更されておらず同じなので、これは JGroups スレッドプールについての話ではないことに注意してください。

source: If you are familiar with making code non blocking it can be a very difficult task as even the most mundane call can be hiding something blocking, even if it is very brief. We could write something to do detect such calls, but there is already an open source tool that does exactly what we needed. This tool is BlockHound, which can detect blocking calls at runtime. More information about it can be found at https://github.com/reactor/BlockHound.
ja_jp: コードをノンブロッキングにすることに慣れていると、非常に難しい作業になります。というのも、ごく普通の呼び出しであっても、たとえそれが非常に短いものであっても、ブロッキングなものを隠してしまうことがあるからです。そのような呼び出しを検出するために何かを書くことができますが、私たちが必要としていたことを正確に行うオープンソースのツールがすでに存在します。このツールはBlockHoundで、実行時にブロッキングの呼び出しを検出することができます。このツールについての詳細は https://github.com/reactor/BlockHound を参照してください。

source: Infinispan takes advantage of blockhound in that we configure it at the module level. This allows the end user to even add block hound with Infinispan in embedded mode and it should work to test out to ensure that interactions with Infinispan are not blocking when needed. Note that we do not yet support block hound for the client, despite many methods are not blocking today.
ja_jp: Infinispanでは、モジュール・レベルで設定するという点で、BlockHound を活用しています。 これにより、エンドユーザは埋め込みモードのInfinispanでもブロックハウンドを追加することができ、必要なときにInfinispanとのやりとりがブロックされていないことを確認するテストを行えます。 今日、多くのメソッドがブロックされていないにもかかわらず、私たちはまだクライアントのBlockHoundをサポートしていないことに注意してください。

source: Infinispan 12 should bring the entire non blocking saga to its hopfully final completion.
ja_jp: Infinispan 12は、ノンブロッキングの物語全体をその希望に満ちた最終的な完成に持ってくるはずです。

source: The aforementioned query modules need to be revamped
ja_jp: 前述の問い合わせモジュールを改良する必要があります。

source: Existing supported cache stores need to be rewritten to directly support non blocking
ja_jp: 既存のサポートされているキャッシュストアは、ノンブロッキングを直接サポートするように書き換える必要があります。

source: Cache retrieval needs to be offloaded to a blocking thread
ja_jp: キャッシュの検索はブロッキングスレッドに受け渡する必要があります。

source: Combine server event loop with non blocking thread pool
ja_jp: サーバイベントループとノンブロッキングスレッドプールの組み合わせ

source: Also if time permits the Infinispan Client would be ensured to be fully non blocking and integrate with BlockHound to ensure client apps behave properly.
ja_jp: また、時間が許せば、Infinispanクライアントは完全にノンブロッキングであることが保証され、クライアントアプリが適切に動作することを保証するためにBlockHoundと統合されます。

source: Operator
ja_jp: オペレータ

source: Other
ja_jp: その他

source: we hope you, your families and colleagues are doing well in these trying times. We've been working hard over the last few months to bring you a brand-new release of Infinispan. Infinispan 12, aptly codenamed https://kildarebrewing.ie/Lockdown-IPA-2-0-5-7-12-Pack-p191649230[Lockdown] comes loaded with a number of notable features as well as the usual slew of fixes and cleanups.
ja_jp: 皆様、ご家族、同僚の皆様におかれましては、この困難な時代を元気に過ごされていることを願っております。私たちはこの数ヶ月間、Infinispanの新しいリリースをお届けするために努力してきました。Infinispan 12は、コードネーム「 link:https://kildarebrewing.ie/Lockdown-IPA-2-0-5-7-12-Pack-p191649230[Lockdown」] と名付けられ、多くの注目すべき機能を搭載しており、通常の修正や手入れも多数含まれています。

source: Indexing and Search
ja_jp: 索引と検索

source: Our good friends over at http://hibernate.org/search/[Hibernate Search] have been working hard on delivering an awesome https://in.relation.to/2020/12/11/hibernate-search-6-0-0-Final/[new release] and have also helped us integrate it in Infinispan. This is not just an upgrade: we have taken the opportunity to evolve our indexing configuration:
ja_jp: link:http://hibernate.org/search/[Hibernate Search] の友人たちは、素晴らしい link:https://in.relation.to/2020/12/11/hibernate-search-6-0-0-Final/[新しいリリースを] 提供するために懸命に働き、Infinispanへの統合にも協力してくれました。これは単なるアップグレードではありません。これを機に、索引の構成を進化させました。

source: Upgraded to Hibernate Search 6, that brings support for Lucene 8 indexes
ja_jp: Hibernate Search 6 にアップグレードし、Lucene 8 の索引をサポートしました。

source: Better indexing performance out of the box
ja_jp: 直ぐに使えてさらに良い索引を作成するパフォーマンスを実現

source: New statistics API, covering indexed, non-indexed and hybrid queries
ja_jp: 索引付き、索引なし、組み合わせた問い合せに対応する新しい統計API

source: Introduced strong typed indexing configuration that replaces the string key/value properties.
ja_jp: 文字列のキー/バリューのプロパティを置き換える強力な型付き索引の設定を導入しました。

source: Head over to the much improved https://infinispan.org/docs/stable/titles/developing/developing.html#search_api[documentation].
ja_jp: 改良された link:https://infinispan.org/docs/stable/titles/developing/developing.html#search_api[ドキュメントを] ご覧ください。

source: We introduced a couple of improvements to the configuration API:
ja_jp: 設定APIの改善点をいくつか導入しました。

source: Runtime creation of templates: the remote APIs now allow creating configuration templates.
ja_jp: テンプレートのランタイム作成：リモートAPIで設定テンプレートを作成できるようになりました。
